START_MESSAGES = [
'''
Привет 👋
Я - бот для удобного отслеживания питания с тренером, выбери роль, которую ты выполняешь:''',

'''
Я твой персональный помощник по питанию и фитнесу!

Здесь ты можешь:
🍏 Отслеживать калории и БЖУ по фото еды, голосовому сообщению или тексту
📊 Получить индивидуальный рацион питания
🏋️‍♂️ Получить персонализированный план тренировок''',
'''
Не беспокойся о подсчёте калорий – я сделаю это за тебя. 
Сосредоточься на своих целях, а я помогу тебе достичь их 💪''',
'''
Отправь мне фото своей еды 📷
Расскажи в голосовом сообщении что ты съел 📣
Или просто напиши текстом описание блюд, в свободной форме ⌨️''',
"После этого я пришлю расчёт калорийности каждого блюда и его белки, жиры, углеводы в виде таблицы",
'''
Какой у тебя сейчас час? Выбери количество часов.
Это нужно для корректной работы сервиса и  более точного рациона питания.
Сейчас установлено время: {}(GMT+{})''',
'''
🎉 Отлично! 
Дарю тебе 3 дня использования бота бесплатно! 
Рад, что ты теперь с нами, и уже на пути к своей цели!''',
'''
Для начала давай определим твою цель по калориям и БЖУ - для этого нажми на кнопку "Рацион"

ИЛИ
Можешь отправить первое фото еды, а рацион составить потом ⬇️''']


USER_START_MESSAGES = [
'''
Я помощник по отслеживанию питанию!

Здесь ты можешь:
🍏 Отслеживать калории и БЖУ по фото еды, голосовому сообщению или тексту
📊 Получить индивидуальный рацион питания
🏋️‍♂️ Получить персонализированный план тренировок''',
'''
Не беспокойся о подсчёте калорий – я сделаю это за тебя. 
Сосредоточься на своих целях, а я помогу тебе достичь их 💪''',
'''
Отправь мне фото своей еды 📷
Расскажи в голосовом сообщении что ты съел 📣
Или просто напиши текстом описание блюд, в свободной форме ⌨️''',
"После этого я пришлю расчёт калорийности каждого блюда и его белки, жиры, углеводы в виде таблицы"
]
TRAINER_START_MESSAGES = [
"Отлично, я - персональный помощник по питанию для твоих клиентов!",
'''
В этом боте клиенты могут:
🍏 Отслеживать калории и БЖУ по фото еды, голосовому сообщению или тексту
📊 Получить индивидуальный рацион питания
🏋️‍♂️ Получить персонализированный план тренировок''',
'''
Клиенты отправляют фото мне, а я подсчитываю КБЖУ за пару секунд, и с высокой точностью.
После чего показываю клиентам их статистику по КБЖУ и сравниваю её с их целями в питании.''',
'''
Тебе, как тренеру, я показываю статистику по каждому клиенту:
🔺 По всем клиентам вместе
🔺 По каждому клиенту отдельно
🔺 Дам рекомендациию по питанию каждого клиента

⚡️Теперь клиенты будут достигать результатов быстрее, а тебе будет горазд проще следить за их питанием''',
'''
Вот твоя личная ссылка для добавления клиентов <code>{}</code>
Просто отправь ссылку клиентам, при переводе по ссылке, они прикрепятся к тебе, и ты сможешь видеть их статистику''',
'''
🎉 Дарю тебе 7 дней бесплатного использования сервиса с полный функционалом.'''
]

TREN_FORM_QUESTIONS = [
    "1) Возраст:",
    "2) Пол (М/Ж):",
    "3) Рост (в см):",
    "4) Вес (в кг):",
    "5) Цель (Например: набрать мышечную массу):",
    "6) Уровень физической подготовки:",
    "7) Медицинские ограничения или травмы которые следует учитывать при составлении плана тренировок:",
    "8) Сколько раз в неделю планируешь тренироваться:",
    "9) Дополнительный комментарий к программе тренировок:",
    "🕐 Составляю план тренировок для тебя, это займёт не больше, чем полминуты"
]

RATION_FORM_QUESTIONS = [
    "1) Возраст:",
    "2) Пол (М/Ж):",
    "3) Рост (в см):",
    "4) Вес (в кг):",
    "5) Цель (Например, набрать мышечную массу):",
    "6) Ограничения в питании:",
    "7) Уровень физической подготовки:",
    "8) Сколько раз в день планируете питаться:",
    "9) Дополнительный комментарий:",
    "🕐 Составляю твой индивидуальный рацион питания, несколько секунд и готово"
]


PAYMENT_MESSAGES = [
'''
Оплата подписки на сумму {} RUB ({})

👉 Перейдите по ссылке для оплаты: {}

После оплаты нажмите "Проверить статус платежа"
''',
]

REF_MESSAGES = [
"По вашей ссылке зарегистрировался новый пользователь: @{}, если он сделает расчет ккалорий то тебе будет доступно еще 3 дня подписки",
"Нельзя переходить по собственной реферальной ссылки",
"Ваш реферал, @{}, ты получаешь 3 дополнительнх дня подписки"
]


MAIN_MENU_MESSAGE = '''
Давай посчитаем калории!

📸 Отправь фото еды
🎤 Запиши голосовое сообщение
📝 Или просто напиши текстом состав приёма пищи

Я распознаю твоё сообщение, оценю еду и порции, и пришлю тебе калорийность и состав БЖУ!
'''

SEND_TABLE_MESSAGES = [
'''
✅Запись добавлена

Твоя дневная цель: {} ккал.
Сегодня ты съел: {} ккал🔥

Белков: {} г/ {} г
Жиров: {} г/ {} г
Углеводов: {} г/ {} г

Можешь съесть еще {} ккал сегодня 😋
''',
'''
✅Запись добавлена

Твоя дневная цель: {} ккал.
Сегодня ты съел: {} ккал🔥

Белков: {} г/ {} г
Жиров: {} г/ {} г
Углеводов: {} г/ {} г
'''
]

BOT_INACTIVE_MESSAGES = [
'''❌Бот не активен!❌
Не забудь оформить подписку на бота!

Ты получишь возможность следить за питанием твоих клиентов, видеть их статистику и поможешь им достигать целей ⚡️
''',
'''Выбери тип подписки:

+ 1 месяц — попробовать
+ 3 месяца – достигнуть целей
''',
'''❌Бот не активен!❌
Твой тренер еще не активировал подписку.

Когда тренер оформит подписку, ты получишь неограниченное число распознаваний по фото, голосу и тексту, доступ к статистике за день и главное - приблизишься к цели ⚡️
''',
'''❌Пробный период закончился❌
Не забудь оформить подписку на бота!

Ты получишь возможность следить за питанием твоих клиентов, видеть их статистику и поможешь им достигать целей ⚡️

Выбери тип подписки:

+ 1 месяц — попробовать
+ 3 месяца – достигнуть целей'''
]

BOT_ACTIVE_MESSAGE = [
'''✅ Подписка активирована
Продолжай считать калории и БЖУ по фото и добиваться результатов ⚡️
''',
'''
✅ Подписка успешно оформлена
Тебе доступен весь функционал бота. Успешного достижения целей!
'''
]
